[
    {
        "title": "Bonjour, merci pour ce joli",
        "date": "2018-10-19T18:18",
        "author": "DDFunky",
        "body": "Bonjour, merci pour ce joli article. je n'ai plus le contexte de la réalisation bien en tète, mais il me semble que ce film d'animation n'a pas été scénarisé par leiji matsumoto, le mangaka a juste approuvé la chose si je me souviens bien.\nDans ce film à la qualité d'animation haut de gamme, c'est le scénario qui souffre de longueurs. J'ai eu du mal à accrocher cette histoire, je préfère l'arcadia de ma jeunesse.\nIci Harlock a la puissance d'un dieu capable de détruire l'univers, c'est un peu too much, excessif, et ses expressions faciales flanquent les jetons, on dirait un psychopathe.\nLe fait qu'il n'y est pas d'enjeux avec une invasion extraterrestre enlève beaucoup de sel à l'histoire.\nPar contre le thème de la surpopulation, probleme universel dont personne ne veut parler, et ses conséquences: pollution, guerre, épuisement des ressources, est bien dans son époque.\nmais harlock ici me parait trop déshumanisé, et il n'y a pas de sylvidres, ni autres extraterrestres."
    },
    {
        "title": "Effectivement, pour ce que je",
        "date": "2018-10-22T17:31",
        "author": "haclong",
        "body": "Effectivement, pour ce que je sais, c'est l'équipe de production du film qui s'est chargé du scénario, Leiji Matsumoto apportant son tampon à la fin pour valider le projet.\n\nToutefois, pour la petite histoire, le final du scénario d'origine reposait sur une passation de pouvoirs. Harlock, tellement empli de ténèbres, n'avait plus d'espace en lui pour supporter l'espoir du monde. Il avait atteint ce point de non retour qui ne pouvait que se conclure tragiquement. En se basant sur cette optique, cela peut expliquer la déshumanisation du pirate, son détachement, son insensibilité, sa détermination froide.\n\nEt Yama apporte le sang neuf, la fougue, la vision d'un monde meilleur. Epris de liberté, de vent dans les cheveux, d'horizons radieux, il est ce que le capitaine a été il y a si longtemps.\n\nLe scénario d'origine tuait habilement le capitaine \"initial\" et le remplaçait par un sosie plus jeune, Yama.\n\nLes nombreuses références répétées à l'envi concernant le pouvoir que Yama possède seul de disposer de la vie de Harlock, promesse tacite que les deux hommes se font pendant le sauvetage sur la planète en perdition\n\nLa mission ultime, confiée à Yama, transmise par Harlock dans la scène finale par l'intermédiaire de la télécommande des bombes cosmiques\n\nL'accident malencontreux qui fait perdre à Yama son oeil et Harlock qui en profite pour lui transmettre le bandeau sur l'oeil\n\nLes capacités de commandement sont à peine remises en question par l'équipage quand Yama les libère.\n\nTori san ne dédaigne pas se poser sur son épaule comme il a coutume de le faire sur l'épaule d'Harlock.\n\nTout était prêt, il n'y avait plus qu'à.\n\nMais Leiji Matsumoto a été choqué par cette idée. Choqué que quelqu'un ait pu seulement imaginer que son précieux capitaine puisse disparaitre. Il a opposé un non catégorique et la fin du film a du être modifiée dans la précipitation. De transmission, que nenni. On verra le message, l'ébauche mais pas le final, quand Yama prend seul les commandes de l'Arcadia et que le capitaine, déjà oublié sur son massif fauteuil, s'évanouirait doucement dans un oubli réconfortant.\n\nBref\n\nConcernant les thèmes de la surpopulation et de l'épuisement des ressources, Matsumoto en parle déjà dans Galaxy Express 999 et dans Harlock également puisque c'est la raison principale qui pousse les Mazones à quitter leur planète mère et à revenir sur Terre. Pour moi, ce sont des thèmes récurrents à l'auteur, traités différemment cette fois ci puisqu'ils sont homo centric cette fois ci. En 2013, je me dis que c'est pas déconnant. Finalement, le message dit qu'on n'a pas besoin d'extra terrestres pour se foutre sur la gueule et tout détruire comme des nuls... C'est en fait encore plus déprimant maintenant qu'on dit que finalement, on est les seuls responsables de ce fiasco.\n\nEnfin, pour le rythme, je ne saurais plus dire si c'est un rythme inhérent au rythme de narration japonaise (je trouve que tous les films japonais souffrent de longueurs, y compris les Ghibli, les Hosoda et autres réalisateurs...)\n\nC'est rigolo que vous trouviez que ce film ait des longueurs alors que Rin Taro est très réputé pour ses films très lents et (presque) contemplatifs... Mais des goûts et des couleurs. J'adore Waga Seishun no Arcadia également qui est un film plus humain et avec un Harlock beaucoup plus fun (mais tragique également).\n\nDans un raccourci affreux, je dirais que le Harlock 2013 est suicidaire alors que le Harlock de Waga Seishun no Arcadia a bien la haine. Mais les deux n'ont pas le même background et le cinéma n'avait pas le même âge non plus. Du coup, ils sont à leur façon un peu le reflet de leurs publics et de l'état du monde..."
    }
]